moved some files and made a diagram
